import "./OnePointOne.css";
import image1 from "../images/image1.png";
import image2 from "../images/image2.png";
import image3 from "../images/image3.png";
import image4 from "../images/image4.png";
import image5 from "../images/image5.png";
import image6 from "../images/image6.png";
import image7 from "../images/image7.png";

function OnePointOne() {
    return(
        <div>
      <p style={{ fontWeight: "bold", textAlign: "center" }}>ԳԼՈՒԽ 1</p>
      <h3 style={{ textAlign: "center" }}>
        Միջին դպրոցում եռանկյունների նմանություն թեման, դրա հիմնական
        հասկացությունները
      </h3>
      <br />
      <div className="firstPage">
        <h4>
          1․1 Միջին դպրոցում եռանկյունների նմանություն թեմային վերաբերվող
          սահմանումներ, թեորեմներ, ընդհանուր տեղեկություններ, պարզաբանումներ:
        </h4>
        <text className="textsForFirstPage">
          <p>
            <b>ԵՌԱՆԿՅՈՒՆՆԵՐԻ ՆՄԱՆՈՒԹՅՈՒՆ</b>
          </p>
          <br />
          <p>
            <b>Սահմանում</b>
          </p>
          Դիցուք ABC և A&#8321; B&#8321; C&#8321; եռանկյունների անկյունները
          համապատասխանաբար հավասար են․ ∠A= ∠A&#8321;, ∠B= ∠B&#8321;, ∠C=
          ∠C&#8321; : Այդ դեպքում հավասար անկյունների դիմաց ընկած AB և A&#8321;
          B&#8321; , BC և B&#8321;C&#8321;, CA և C&#8321;A&#8321; կողմերը
          կոչվում են նմանակերպ։
          <br />
          <p>
            <b>Սահմանում</b>
          </p>
          Երկու եռանկյունիները կոչվում են նման, եթե նրանց անկյունները
          համապատասխանաբար հավասար են և մի եռանկյան կողմերը համեմատական են
          մյուսի նմաննակերպ կողմերին։
          <br />
          Ըստ սահմանման`
          <br />
          <img src={image1} alt="" />
          <br />k թիվը կոչվում է նմանության գործակից։
          <p>
            <b>Թեորեմ։</b> (Եռանկյունների նմանության հայտանիշները)։
          </p>
          <p>Երկու եռանկյուններ նման են․</p>
          <br />
          <p>
            1. Եթե նրանցից մեկի երկու անկյունները համապատասխանաբար հավասար են
            մյուսի երկու անկյուններին,
          </p>
          <p>
            2. եթե նրանցից մեկի երկու կողմերը համեմատական են մյուսի երկու
            կողմերին և այդ կողմերով կազմված անկյունները հավասար են,
          </p>
          <p>
            3. եթե նրանցից նեկի երեք կողմերը համեմատական են մյուսի երեք
            կողմերին։
          </p>
          <br />
          <p>
            <b>Հատկություններ։ </b>
          </p>
          <br />
          <p>
            1. Նման եռանկյունների մեջ համապատասխան հատվածների հարաբերությունը
            հավասար է նմանության գործակցին։
          </p>
          <p>
            2. Նման եռանկյունների պարագծերի հարաբերությունը հավասար է նմանության
            գործակցին, իսկ մակերեսների հարաբերությունը հավասար է նմանության
            գործակցի քառակուսուն։
          </p>
          <p>
            3. Եռանկյան միջնագծերը հատվում են մի կետում, որը յուրաքանչյուր
            միջնագիծը բաժանում է 2 ։ 1 հարաբերությամբ՝ հաշված գագաթից։
          </p>
          <p>
            4. Ուղղանկյուն եռանկյան ուղիղ անկյան գագաթից տարված բարձրությունը
            եռանկյունը բաժանում է երկու նման ուղղանկյուն եռանկյունների, որոնցից
            յուրաքանչյուրը նման է եռանկյանը։
          </p>
          <br />
          <img src={image2} alt="" />
          <br />
          <p>5. CD&#178; = AD:DB: AC&#178;= AB AD: CB&#178;= AB DB:</p>
          <p>
            6. Եռանկյան երկու կողմերը հատող և երրորդ կողմին զուգահեռ ուղիղը
            նրանից անջատում է տարված եռանկյանը նման եռանկյունը։
          </p>
          <p>
            7. Սեղանի հիմքերով և անկյունագծերով առաջացած եռանկյունները նման են։
          </p>
        </text>
        <br />
        <text className="textsForFirstPage">
          <p>
            <b>3․ Եռանկյուններ</b>
          </p>
          <br />
          <img src={image3} alt="" />
          <hr style={{height: '5px', backgroundColor: 'black'}}></hr>
          <br />
          <p>
            <b>Եռանկյունների նմանության հայտանիշները</b>
          </p>
          <br />
          Երկու եռանկյուններ կոչվում են , <b>նման </b>եթե նրանց անկյունները
          համապատասխանաբարհավասար են, և հավասար անկյունների դիմաց գտնվող կողմերը
          համեմատական են։
          <br />
          <img src={image4} alt="" />
          <br />k թիվը, որը հավասար է եռանկյունների համապատասխան կողմերի
          հարաբերությանը, կոչվում է <b>նմանության գործակից։</b>
          <br />
          <img src={image5} alt="" />
          <br />
          <img src={image6} alt="" />
          <hr style={{height: '5px', backgroundColor: 'black'}}></hr>
          <br />
          <p>
            <b>Նման եռանկյունների օրինակներ</b>
          </p>
          <br />
          <img src={image7} alt="" />
          <br />
        </text>
        </div>
        </div>
    )
}

export default OnePointOne;